====================================
Variable definition
====================================
{{ $variable := pipeline }}
{{ $1var := pipeline }}
{{ $variable2 := ($variable2 := 5) }}
---

(template
  (variable_definition
    (variable
      (identifier))
    (function_call
      (identifier)))
  (text)
  (variable_definition
    (variable
      (identifier))
    (function_call
      (identifier)))
  (text)
  (variable_definition
    (variable
      (identifier))
    (parenthesized_pipeline
      (variable_definition
        (variable
          (identifier))
        (int_literal)))))

====================================
Variable assignment
====================================
{{ $variable = pipeline }}
---
(template
    (assignment
        (variable (identifier))
        (function_call (identifier))))

====================================
Range pipeline assignment
====================================
{{ range $index, $element := pipeline }}{{ $index }}{{ $element }}{{ end }}
---
(template
    (range_action
        (range_variable_definition
            (variable (identifier))
            (variable (identifier))
            (function_call
                (identifier)))
        (variable (identifier))
        (variable (identifier))))

====================================
Invalid variable definition
====================================
{{ $variable := $variable := 5 }}
---

(template
  (variable_definition
    (variable
      (identifier))
    (variable
      (identifier)))
  (ERROR
    (int_literal)))

====================================
Invalid variable assignment
====================================
{{ $var = $var = 5 }}
------------------------------------

(template
  (assignment
    (variable
      (identifier))
    (variable
      (identifier)))
  (ERROR
    (int_literal)))
